{"html":"<h1 class=\"title is-1\"  id=\"basic-usage-tutorial\">Basic usage tutorial</h1>\n<h2 class=\"title is-2\"  id=\"first-steps\">First steps</h2>\n<p><strong>Step #1</strong>:The app runs in a browser from this address:</p>\n<p><a href=\"/app/\">Shriveling world</a></p>\n<p><strong>Step #2</strong>: Once the app runs in the browser data is read by two alternative ways:</p>\n<ul>\n<li>Click on predefined dataset list on the left side of the browser window</li>\n<li>Introduce data in the app by drag &amp; drop (see below)</li>\n</ul>\n<p><em>Attention: in any case data processing may take time, depending on the number of cities and the performance of your own machine, CPU and GPU. So once you have clicked on the list of predefined datasets or drag & drop files, you have to wait for a few seconds</em></p>\n<p><strong>Step #3</strong>: enjoy! <a href=\"#navigation\">navigate</a> around the three dimensional structure with <a href=\"#navigation\">mouse controls</a>, define projection through interface, define desired control parameters through the interface on the right. Reload the page in the browser before changing dataset.</p>\n<h2 class=\"title is-2\"  id=\"introducing-data-in-the-application-by-drag--drop\">Introducing data in the application by drag &amp; drop</h2>\n<p>Drag &amp; drop the following geojson and csv files found in the folder datasets in the web app:</p>\n<ul>\n<li>cities.csv</li>\n<li>population.csv</li>\n<li>transport_mode_code.csv</li>\n<li>transport_mode_speed.csv</li>\n<li>transport_network.csv</li>\n<li>110m_land_shrivel.geojson</li>\n</ul>\n<h2 class=\"title is-2\"  id=\"general-parameters\">General parameters</h2>\n<p>Instructions for the application are provided in a lateral user interface.</p>\n<p>Most commands can be accessed through the lateral UI:</p>\n<ul>\n<li><p><strong>Year</strong>: base year of the representation (value in the networks files) 'Generalities', 'year'</p></li>\n<li><p><strong>Cartographic projection</strong>:</p>\n<ul>\n<li><strong>Static</strong>: change 'Generalities', 'projection', 'Initial projection' the variable <em>projectionInit</em> : projection with values in in the following range :</li>\n<li>'none' for a three dimensional un-projected representation</li>\n<li>'equirectangular' or 1 for an equilateral flat representation</li>\n<li>'Mercator' or 2 for a 2-dimensional Mercator</li>\n<li><strong>Dynamic</strong></li>\n<li>Set the final projection: 'Generalities', 'projection', 'final projection'</li>\n<li>'transition': transition value between projectionBegin and projectionEnd. Value included in the range 0 to 100 included.</li></ul></li>\n</ul>\n<h2 class=\"title is-2\"  id=\"parameters-of-the-geometry-of-the-model\">Parameters of the geometry of the model</h2>\n<p>More detail about the three dimensional geometry of the model, <a href=\"/marks/usrdoc/model_geometry\">here</a>.</p>\n<ul>\n<li><p><strong>Cones</strong>:</p>\n<ul>\n<li><strong>Color</strong>: Menu 'Cones', 'cones color'</li>\n<li><strong>Rendering quality</strong>: <code>coneStep</code> modifies the visual aspect of cones. The default value is 15 degrees, a facet = 15°; a recommended value is 5 or less. Lower values will generate higher quality graphics, at the cost of larger export files and resource consuming rendering</li>\n<li>The <strong>shape of cones</strong> has currently three available options:<ul>\n<li>in the default <strong>based on road</strong> case, all cones are simple regular cones with a unique slope -- for a given year -- based on the road speed</li>\n<li>in the <strong>fast terrestrial transport mode</strong> case, cones all have a regular shape but may have different slopes; the slope of a cone is determined by the connection to a terrestrial transport mode faster than road. The mere connection of the city to the a high speed rail line network will alter the slope of its cone, expressing its access to fast speed. In this case the slope, i.e. the local time-space relative speed, is potentially wrong in many places, but we produce an image that highlights the connectivity of cities to hight speed terrestrial transport networks. In this case, we ignore the 'tunnel effect' of fast transport networks.</li>\n<li>in the <strong>complex cones</strong> case, cones are locally deformed based on existing incoming or departing edges of transport terrestrial transport modes faster than road, typically expressway or High-Speed Rail lines. In this case, as in the previous one, we ignore the 'tunnel effect' of fast transport networks.</li>\n<li>More to come: the [horse saddle]()</li></ul></li></ul></li>\n<li><p><strong>Curves</strong>:</p>\n<ul>\n<li><strong>Color</strong> and <strong>transparency</strong>: curves may have a different color and transparency according to the transport mode they represent, chosen in 'Curves', 'terrestrial modes' and 'Aircraft'</li>\n<li><strong>Straight lines</strong> or <strong>curves</strong>:  the parameter 'nb of points' will populate the variable  <code>nbPointsPerCurve=X</code> where X is an integer between 1 and 199 included. This value determines the way curves are drawn:</li>\n<li>The value <strong>1</strong> draws all straight lines</li>\n<li>The value <strong>2</strong> draws a broken line, as two segments with an intermediate point; the line has the desired length</li>\n<li>A value superior to <strong>2</strong> will interpolate a Bézier curve of the desired length. This curve can be a geodesic in the non projected case, or can be a longer curve. Recommended value is superior to <strong>50</strong> for a high quality graphic</li></ul></li>\n</ul>\n<h2 class=\"title is-2\"  id=\"navigation\">Navigation</h2>\n<ul>\n<li>click + scroll</li>\n<li>alt scroll = rotation</li>\n<li>ctrl scroll = translation</li>\n</ul>\n<h2 class=\"title is-2\"  id=\"exports\">Exports</h2>\n<ul>\n<li><p>The <strong>three dimensional scene</strong> can be exported. Export to gltf (.obj) file format is available (red button in the bottom). In order to import in Blender the file produced from the app, see <a href=\"/marks/usrdoc/blender_instructions\">Blender instructions</a>.</p></li>\n<li><p>A <strong>travel times matrix</strong> in minutes between the cities of the input dataset can be exported (for generating plastic space maps for instance). <em>Year</em> of reference is fixed in the GUI interface. The matrix computation is preceded by the generation of multiple road edges in order to provide the minimum path algorithm with sufficient input data. The matrix is exported from the browser console (F12, Ctrl + Shift + K or Command + Option + K) with the instruction:</p>\n<ul>\n<li><code>bigBoard._merger.merge(true,'aFileNameForTheMatrix')</code></li></ul></li>\n</ul>\n<h2 class=\"title is-2\"  id=\"more-parameters-with-the-console\">More parameters with the console</h2>\n<p>Instructions to the application can also be entered in the console of the browser (F12, Ctrl + Shift + K or Command + Option + K):</p>\n<p><code>shriveling.configuration.XXX=value</code></p>\n<p>with <code>XXX</code> and <code>value</code> in the following range:</p>\n<ul>\n<li><code>intrudedHeightRatio</code> : sets the height of cones, in the range [0,1], a ratio of the earth radius</li>\n</ul>\n<h2 class=\"title is-2\"  id=\"testing-lengths-and-angles\">Testing lengths and angles</h2>\n<p>As the final output of the tool is, in the general case, an image, testing the distances and angles is a way to make sure the model is correct:</p>\n<ul>\n<li>length of straight edges and links can be <a href=\"https://timespace.hypotheses.org/115\">measured with a ruler on the screen</a> or on a printed image</li>\n<li>length of curves may be measured by means of a little string adjusted along the image and then measured with the ruler</li>\n<li>measuring angles with <a href=\"https://www.ginifab.com/feeds/angle_measurement/\">an on-line protractor tool</a></li>\n</ul>"}